In [7]:
pip install pandas

Requirement already satisfied: pandas in c:\users\clemens fritzen\appdata\local\programs\python\python312\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\clemens fritzen\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\clemens fritzen\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\clemens fritzen\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\clemens fritzen\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\clemens fritzen\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

 ········

In [4]:
sk = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+sk
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [5]:
connection = engine.connect()

row=result.first()
type(row)

In [53]:
def querys_month(engine,m,y):
    with engine.connect() as connection:
        query = text(f"SELECT * FROM rental where YEAR(rental_date)={y} and MONTH(rental_date)={m}")
        result = connection.execute(query)
        df=pd.DataFrame(result.all())
    return df

In [54]:
print(querys_month(engine,5,2005))

      rental_id         rental_date  inventory_id  customer_id  \
0             1 2005-05-24 22:53:30           367          130
1             2 2005-05-24 22:54:33          1525          459
2             3 2005-05-24 23:03:39          1711          408
3             4 2005-05-24 23:04:41          2452          333
4             5 2005-05-24 23:05:21          2079          222
...         ...                 ...           ...          ...
1151       1153 2005-05-31 21:36:44          2725          506
1152       1154 2005-05-31 21:42:09          2732           59
1153       1155 2005-05-31 22:17:11          2048          251
1154       1156 2005-05-31 22:37:34           460          106
1155       1157 2005-05-31 22:47:45          1449           61

             return_date  staff_id         last_update
0    2005-05-26 22:04:30         1 2006-02-15 21:30:53
1    2005-05-28 19:40:33         1 2006-02-15 21:30:53
2    2005-06-01 22:12:39         1 2006-02-15 21:30:53
3    2005-06-03 01:43:41         2 2006-02-15 21:30:53
4    2005-06-02 04:33:21         1 2006-02-15 21:30:53
...                  ...       ...                 ...
1151 2005-06-10 01:26:44         2 2006-02-15 21:30:53
1152 2005-06-08 16:40:09         1 2006-02-15 21:30:53
1153 2005-06-04 20:27:11         2 2006-02-15 21:30:53
1154 2005-06-01 23:02:34         2 2006-02-15 21:30:53
1155 2005-06-02 18:01:45         1 2006-02-15 21:30:53

[1156 rows x 7 columns]

In [68]:
def rental_month_count(df_querys,m,y):
    df=df_querys.groupby("customer_id").agg("count")
    df=df.rename(columns={"rental_date":f"rentals_{m}_{y}"})
    df=df.drop(columns=["rental_id","inventory_id","staff_id","last_update","return_date"])
        
    return df
    
rental_month_count(querys_month(engine,5,2005),5,2005)

             rentals_5_2005
customer_id
1                         2
2                         1
3                         2
5                         3
6                         3
...                     ...
594                       4
595                       1
596                       6
597                       2
599                       1

[520 rows x 1 columns]

In [73]:
def compare_rentals(df1,df2):
    df=pd.merge(df1, df2, on ="customer_id")
    df["difference"]=df[df.columns[0]]-df[df.columns[1]]

    return df

In [74]:
dfone=rental_month_count(querys_month(engine,5,2005),5,2005)
dftwo=rental_month_count(querys_month(engine,2,2006),2,2006)

compare_rentals(dfone,dftwo)

             rentals_5_2005  rentals_2_2006  difference
customer_id
5                         3               1           2
9                         3               1           2
11                        1               1           0
14                        5               1           4
21                        3               1           2
...                     ...             ...         ...
582                       1               1           0
587                       2               1           1
590                       1               1           0
596                       6               1           5
597                       2               1           1

[139 rows x 3 columns]